2021-06-13-let-and-binding-macros-in-clojure.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://www.birkey.co/rss.xml"
      title="RSS feed for https://www.birkey.co/">
<title>Let and Binding macros in Clojure</title>
<meta name="author" content="Kasim Tuman">
	     <meta name="referrer" content="no-referrer">
	     <link href= "static/style.css" rel="stylesheet" type="text/css" />
	     <link rel="icon" href="static/favicon.ico">
	     <link rel="apple-touch-icon-precomposed" href="static/birkey_logo.png">
	     <link rel="msapplication-TitleImage" href="static/birkey_logo.png">
	     <link rel="msapplication-TitleColor" href="#0141ff">
	     <link rel="alternate" type="application/rss+xml"  title="RSS Feed for birkey.co" href="/rss.xml"
	     <meta http-equiv="content-type" content="application/xhtml+xml; charset=UTF-8">
	     <meta name="viewport" content="initial-scale=1,width=device-width,minimum-scale=1"></head>
<body>
<div id="preamble" class="status"><br><center>
    <div style="display: inline-block; vertical-align:middle;">
<a href="https://www.birkey.co/index.html" style="text-decoration: none;"><b>BIRKEY CONSULTING</b><br>
</a><hr/><div style="text-align: justify;display: inline-block; width: 100%;">
<a class="title" href="https://www.birkey.co/resume.html">ABOUT</a> &nbsp;<a class="title" href="https://github.com/oneness">GITHUB</a> &nbsp;<a class="title" href="https://www.birkey.co/rss.xml">RSS</a> &nbsp;<a class="title" href="https://www.birkey.co/archive.html">ARCHIVE</a> &nbsp;<a class="title" href="https://paypal.me/ktuman">DONATE</a></div></div>
</center><br><br>
<div style="margin-bottom: 3ch;text-transform: none;"></div></div>
<div id="content">
<div class="post-date">13 Jun 2021</div><h1 class="post-title"><a href="https://www.birkey.co/2021-06-13-let-and-binding-macros-in-clojure.html">Let and Binding macros in Clojure</a></h1>
<p>
Clojure has number special forms. Among them are <b>let</b> and
<b>binding</b> that are implemented as macros. For new comers to Clojure,
above can be confusing to understand, which I hope to address in this
blog post. If you have read "Programming Clojure" book, you might be
thinking that it is easy to use them correctly considering following
straightforward example:
</p>

<div class="org-src-container">
<pre class="src src-clojure">(def x 7) ;; bind the var x to the value 7
(defn print-x [x]
  (println x))

(let [x 9]
  (print-x)) ;; prints 7

(binding [x 9]
  (print-x)) ;; prints 9
</pre>
</div>
<p>
Why? Because <b>let</b> creates a lexical scoped vars, which is local to
the code block or functions where it is initially defined while <b>def</b>
creates a global var that is visible to all functions under the
namespace that you are in. Therefore, in the example above, <b>let</b> just
created a new "x" with the value of 9. But it is not local to the
function "print-x". That is to say, "print-x" have no knowledge of the
local scoped binding that is created by <b>let</b>. <b>binding</b> macro instead
creates a new binding for the already existed var, "x" with the value
of 9. Since "print-x" is evaluated within the <b>binding</b> form, the
newly bound value is visible to any chained calls within the form. All
nice and easy. However, it is not that obvious to understand and use
them correctly. Look at following example:
</p>
<div class="org-src-container">
<pre class="src src-clojure">(def x 7)
(def y 9)

(let [x 5 y x] y) ;; returns 5
(binding [x 5 y x] y) ;; returns 7
</pre>
</div>
<p>
<b>let</b> example is just fine. It created a new var "y" with the value of
5 bound to it. But what is going on with the <b>binding</b> example? If we
dig little deeper to Clojure API doc, we learn that the new bindings
in <b>binding</b> are made in parallel, not sequential as it is in <b>let</b>.
Therefore, existing var "y" gets bound to the root binding of "x" not
the overshadowed value of "x", which is the case in the <b>let</b> example.
OK, so far so good. Let us look at another example:
</p>
<div class="org-src-container">
<pre class="src src-clojure">(defn print-x [&amp; args]
  (println "print-x prints: " args))
(defn print-y [&amp; args]
  (println "print-y prints: " args))
(let [print-x print-y] (print-x 123)) ;; print-y prints: (1 2 3)
(binding [print-x print-y] (print-x 123)) ;; print-y prints: (1 2 3)
(binding [print-x print-y] #(print-x 123)) ;; prints
					     ;; cryptic "#&lt;user$eval__28$fn__30
					     ;; user$eval__28$fn__30@bdb503&gt;"
((binding [print-x print-y] #(print-x 123))) ;; print-x prints: (1 2 3)
</pre>
</div>
<p>
All the lines but the last two are pretty straight forward. But how
about the last line? Shouldn't it call "print-y" function? Not really.
It is because the anonymous function is evaluated outside of the
<b>binding</b> form. The "#&lt;user$eval_<sub>28</sub>$fn_<sub>30</sub>
user$eval_<sub>28</sub>$fn_<sub>30</sub>@bdb503&gt;" is an indication that anonymous function
did not get evaluated. The extra parens evals above form. Ok,
now, how do you make sure it evaluates within the <b>binding</b> form? Just
enclose the anonymous function within parenthesis. What do we learn
from all of the above? Here are the summary that helps one use <b>let</b>
and <b>binding</b> correctly:
</p>

<ul class="org-ul">
<li>Use <b>binding</b> only if you are trying to alter a behavior dynamically
for special-vars that is already defined. Enclose your special vars
within * as recommended by idiomatic clojure to make your intent
clear.</li>
<li>Use <b>let</b> for locally scoped vars and avoid shadowing already
defined vars.</li>
<li>Remember <b>let</b> binding is sequential and <b>binding</b> binding is done in parallel.</li>
<li>Pay close attention to the scope of the <b>binding</b> form. Any
expression that is not evaluated inside the form, will not see the
binding. That is to say, binding in <b>binding</b> form is thread local
starting from the <b>binding</b> form until it ends including any
expression that is chained within the form, which is what the
thread-local are all about.</li>
<li>Lastly avoid using <b>binding</b> as much as possible. I have seen many
production bugs related to issues I outlined here.</li>
</ul>
<div class="taglist"><a href="https://www.birkey.co/tags.html">Tags</a>: <a href="https://www.birkey.co/tag-clojure.html">clojure</a> </div></div>
<div id="postamble" class="status"><br><center>
	   <div style="display: inline-block; vertical-align:middle;"></div></div>
</body>
</html>
